title: Correlation rule test number 14
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x14
description: Correlation rule created to test CCE engine - 14
references:
    - https://google.com/123456789x14
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.postgresql.src_ip: '192.168.180.*'
    ids.snort.duser: 'duser180'
    proxy.squid.dhost: 'dhost180'
    condition: sgbd.postgresql.src_ip and ids.snort.duser and proxy.squid.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
