title: Correlation rule test number 15
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x15
description: Correlation rule created to test CCE engine - 15
references:
    - https://google.com/123456789x15
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.mysql.src_ip: '192.168.181.*'
    ids.snort.duser: 'duser181'
    firewall.ciscoasa.dhost: 'dhost181'
    condition: sgbd.mysql.src_ip and ids.snort.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
