title: Correlation rule test number 19
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x19
description: Correlation rule created to test CCE engine - 19
references:
    - https://google.com/123456789x19
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.186.*'
    firewall.ciscoasa.duser: 'duser186'
    sgbd.mysql.dhost: 'dhost186'
    condition: webserver.php.src_ip and firewall.ciscoasa.duser and sgbd.mysql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
