title: Correlation rule test number 22
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x22
description: Correlation rule created to test CCE engine - 22
references:
    - https://google.com/123456789x22
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.ciscoasa.src_ip: '192.168.108.*'
    proxy.squid.duser: 'duser108'
    sgbd.mysql.dhost: 'dhost108'
    condition: firewall.ciscoasa.src_ip and proxy.squid.duser and sgbd.mysql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
