title: Correlation rule test number 24
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x24
description: Correlation rule created to test CCE engine - 24
references:
    - https://google.com/123456789x24
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.sonicwall.src_ip: '192.168.159.*'
    ids.snort.duser: 'duser159'
    sgbd.mysql.dhost: 'dhost159'
    condition: firewall.sonicwall.src_ip and ids.snort.duser and sgbd.mysql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
