title: Correlation rule test number 27
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x27
description: Correlation rule created to test CCE engine - 27
references:
    - https://google.com/123456789x27
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.111.*'
    firewall.sonicwall.duser: 'duser111'
    webserver.php.dhost: 'dhost111'
    condition: webserver.php.src_ip and firewall.sonicwall.duser and webserver.php.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
