title: Correlation rule test number 29
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x29
description: Correlation rule created to test CCE engine - 29
references:
    - https://google.com/123456789x29
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    proxy.squid.src_ip: '192.168.119.*'
    firewall.ciscoasa.duser: 'duser119'
    firewall.ciscoasa.dhost: 'dhost119'
    condition: proxy.squid.src_ip and firewall.ciscoasa.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
