title: Correlation rule test number 30
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x30
description: Correlation rule created to test CCE engine - 30
references:
    - https://google.com/123456789x30
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.sonicwall.src_ip: '192.168.192.*'
    sgbd.postgresql.duser: 'duser192'
    sgbd.postgresql.dhost: 'dhost192'
    condition: firewall.sonicwall.src_ip and sgbd.postgresql.duser and sgbd.postgresql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
