title: Correlation rule test number 31
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x31
description: Correlation rule created to test CCE engine - 31
references:
    - https://google.com/123456789x31
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.22.*'
    sgbd.postgresql.duser: 'duser22'
    firewall.ciscoasa.dhost: 'dhost22'
    condition: webserver.php.src_ip and sgbd.postgresql.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
