title: Correlation rule test number 37
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x37
description: Correlation rule created to test CCE engine - 37
references:
    - https://google.com/123456789x37
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.58.*'
    sgbd.postgresql.duser: 'duser58'
    sgbd.mysql.dhost: 'dhost58'
    condition: webserver.php.src_ip and sgbd.postgresql.duser and sgbd.mysql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
