title: Correlation rule test number 40
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x40
description: Correlation rule created to test CCE engine - 40
references:
    - https://google.com/123456789x40
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    ids.snort.src_ip: '192.168.187.*'
    firewall.ciscoasa.duser: 'duser187'
    webserver.php.dhost: 'dhost187'
    condition: ids.snort.src_ip and firewall.ciscoasa.duser and webserver.php.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
