title: Correlation rule test number 41
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x41
description: Correlation rule created to test CCE engine - 41
references:
    - https://google.com/123456789x41
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.postgresql.src_ip: '192.168.167.*'
    ids.snort.duser: 'duser167'
    ids.snort.dhost: 'dhost167'
    condition: sgbd.postgresql.src_ip and ids.snort.duser and ids.snort.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
