title: Correlation rule test number 43
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x43
description: Correlation rule created to test CCE engine - 43
references:
    - https://google.com/123456789x43
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    ids.snort.src_ip: '192.168.216.*'
    proxy.squid.duser: 'duser216'
    ids.snort.dhost: 'dhost216'
    condition: ids.snort.src_ip and proxy.squid.duser and ids.snort.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
