title: Correlation rule test number 44
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x44
description: Correlation rule created to test CCE engine - 44
references:
    - https://google.com/123456789x44
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.sonicwall.src_ip: '192.168.218.*'
    proxy.squid.duser: 'duser218'
    firewall.ciscoasa.dhost: 'dhost218'
    condition: firewall.sonicwall.src_ip and proxy.squid.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
