title: Correlation rule test number 49
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x49
description: Correlation rule created to test CCE engine - 49
references:
    - https://google.com/123456789x49
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    proxy.squid.src_ip: '192.168.39.*'
    sgbd.mysql.duser: 'duser39'
    firewall.ciscoasa.dhost: 'dhost39'
    condition: proxy.squid.src_ip and sgbd.mysql.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
