title: Correlation rule test number 50
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x50
description: Correlation rule created to test CCE engine - 50
references:
    - https://google.com/123456789x50
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.sonicwall.src_ip: '192.168.6.*'
    ids.snort.duser: 'duser6'
    firewall.ciscoasa.dhost: 'dhost6'
    condition: firewall.sonicwall.src_ip and ids.snort.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
