title: Correlation rule test number 20
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x20
description: Correlation rule created to test CCE engine - 20
references:
    - https://google.com/123456789x20
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.149.*'
    firewall.sonicwall.duser: 'duser149'
    proxy.squid.dhost: 'dhost149'
    condition: webserver.php.src_ip and firewall.sonicwall.duser and proxy.squid.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
