title: Correlation rule test number 35
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x35
description: Correlation rule created to test CCE engine - 35
references:
    - https://google.com/123456789x35
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.postgresql.src_ip: '192.168.255.*'
    firewall.ciscoasa.duser: 'duser255'
    proxy.squid.dhost: 'dhost255'
    condition: sgbd.postgresql.src_ip and firewall.ciscoasa.duser and proxy.squid.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
