title: Correlation rule test number 39
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x39
description: Correlation rule created to test CCE engine - 39
references:
    - https://google.com/123456789x39
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.15.*'
    sgbd.mysql.duser: 'duser15'
    webserver.php.dhost: 'dhost15'
    condition: webserver.php.src_ip and sgbd.mysql.duser and webserver.php.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
