title: Correlation rule test number 42
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x42
description: Correlation rule created to test CCE engine - 42
references:
    - https://google.com/123456789x42
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.mysql.src_ip: '192.168.231.*'
    webserver.php.duser: 'duser231'
    sgbd.postgresql.dhost: 'dhost231'
    condition: sgbd.mysql.src_ip and webserver.php.duser and sgbd.postgresql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
