title: Correlation rule test number 46
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x46
description: Correlation rule created to test CCE engine - 46
references:
    - https://google.com/123456789x46
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    sgbd.mysql.src_ip: '192.168.96.*'
    ids.snort.duser: 'duser96'
    ids.snort.dhost: 'dhost96'
    condition: sgbd.mysql.src_ip and ids.snort.duser and ids.snort.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
