title: Correlation rule test number 34
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x34
description: Correlation rule created to test CCE engine - 34
references:
    - https://google.com/123456789x34
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.sonicwall.src_ip: '192.168.199.*'
    firewall.sonicwall.duser: 'duser199'
    firewall.ciscoasa.dhost: 'dhost199'
    condition: firewall.sonicwall.src_ip and firewall.sonicwall.duser and firewall.ciscoasa.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
