title: Correlation rule test number 45
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x45
description: Correlation rule created to test CCE engine - 45
references:
    - https://google.com/123456789x45
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.ciscoasa.src_ip: '192.168.243.*'
    ids.snort.duser: 'duser243'
    sgbd.postgresql.dhost: 'dhost243'
    condition: firewall.ciscoasa.src_ip and ids.snort.duser and sgbd.postgresql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
