title: Correlation rule test number 6
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x6
description: Correlation rule created to test CCE engine - 6
references:
    - https://google.com/123456789x6
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    firewall.ciscoasa.src_ip: '192.168.17.*'
    webserver.php.duser: 'duser17'
    firewall.sonicwall.dhost: 'dhost17'
    condition: firewall.ciscoasa.src_ip and webserver.php.duser and firewall.sonicwall.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
