title: Correlation rule test number 8
type: Correlation
id: 12345678-abcd-1234-abcd-123456789x8
description: Correlation rule created to test CCE engine - 8
references:
    - https://google.com/123456789x8
status: experimental
author: 'Adriano Serckumecka'
logsource:
    category: many
    product: many
detection:
    webserver.php.src_ip: '192.168.181.*'
    firewall.sonicwall.duser: 'duser181'
    sgbd.postgresql.dhost: 'dhost181'
    condition: webserver.php.src_ip and firewall.sonicwall.duser and sgbd.postgresql.dhost
timeframe: 1m
falsepositives:
    - unknown
level: high
